In [11]:
# Import pandas module and give it an alias 'pd'
import pandas as pd

In [12]:
"""
Read a CSV file into a DataFrame using the read_csv function.
Specify the file path using a raw string (r"") to avoid escape character issues.
Use 'parse_dates' option to parse the 'Date' column as dates.
Set the 'Date' column as the index of the DataFrame using 'index_col'.
"""
df = pd.read_csv(r"C:\Users\admin\OneDrive\Desktop\Datasets\retail_sales_dataset.csv", parse_dates=['Date'], index_col='Date')

"""
Set a display option to control the formatting of floating-point numbers.
The lambda function takes a floating-point number 'x' and formats it to two decimal places.
"""
pd.set_option('display.float_format', lambda x: '%.2f' % x)

In [13]:
# Return the first 5 rows
df.head(5)

,Transaction ID,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
Date,,,,,,,,
2023-11-24,1,CUST001,Male,34,Beauty,3,50,150
2023-02-27,2,CUST002,Female,26,Clothing,2,500,1000
2023-01-13,3,CUST003,Male,50,Electronics,1,30,30
2023-05-21,4,CUST004,Male,37,Clothing,1,500,500
2023-05-06,5,CUST005,Male,30,Beauty,2,50,100

In [14]:
# Return the last 5 rows
df.tail(5)

,Transaction ID,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
Date,,,,,,,,
2023-05-16,996,CUST996,Male,62,Clothing,1,50,50
2023-11-17,997,CUST997,Male,52,Beauty,3,30,90
2023-10-29,998,CUST998,Female,23,Beauty,4,25,100
2023-12-05,999,CUST999,Female,36,Electronics,3,50,150
2023-04-12,1000,CUST1000,Male,47,Electronics,4,30,120

In [15]:
# Assign the DataFrame 'df' to a new variable 'retail_sales'
retail_sales = df

# Use 'info()' method to display a concise summary of the DataFrame
retail_sales.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1000 entries, 2023-11-24 to 2023-04-12
Data columns (total 8 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction ID    1000 non-null   int64
 1   Customer ID       1000 non-null   object
 2   Gender            1000 non-null   object
 3   Age               1000 non-null   int64
 4   Product Category  1000 non-null   object
 5   Quantity          1000 non-null   int64
 6   Price per Unit    1000 non-null   int64
 7   Total Amount      1000 non-null   int64
dtypes: int64(5), object(3)
memory usage: 70.3+ KB

In [16]:
"""
Generate descriptive statistics of the DataFrame i.e. count, mean, standard deviation, minimum, 25th percentile,
median, 75th percentile and maximum values for each numeric column
"""
retail_sales.describe()

       Transaction ID     Age  Quantity  Price per Unit  Total Amount
count         1000.00 1000.00   1000.00         1000.00       1000.00
mean           500.50   41.39      2.51          179.89        456.00
std            288.82   13.68      1.13          189.68        560.00
min              1.00   18.00      1.00           25.00         25.00
25%            250.75   29.00      1.00           30.00         60.00
50%            500.50   42.00      3.00           50.00        135.00
75%            750.25   53.00      4.00          300.00        900.00
max           1000.00   64.00      4.00          500.00       2000.00

In [17]:
# Check for null values
retail_sales.isnull().sum()

Transaction ID      0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [18]:
# Use nunique() method to count the number of unique values in each column of the DataFrame
retail_sales.nunique()

Transaction ID      1000
Customer ID         1000
Gender                 2
Age                   47
Product Category       3
Quantity               4
Price per Unit         5
Total Amount          18
dtype: int64

In [19]:
# Top 5 customers by Total Amount
retail_sales.sort_values(by = 'Total Amount', ascending=False).head(5)

,Transaction ID,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
Date,,,,,,,,
2023-04-20,572,CUST572,Male,31,Clothing,4,500,2000
2023-10-01,89,CUST089,Female,55,Electronics,4,500,2000
2023-10-25,503,CUST503,Male,45,Beauty,4,500,2000
2023-05-27,561,CUST561,Female,64,Clothing,4,500,2000
2023-09-11,832,CUST832,Male,47,Beauty,4,500,2000

In [20]:
# Bottom 5 customers by Total Amount
retail_sales.sort_values(by = 'Total Amount').head(5)

,Transaction ID,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
Date,,,,,,,,
2023-03-08,423,CUST423,Female,27,Clothing,1,25,25
2023-05-02,242,CUST242,Male,21,Clothing,1,25,25
2023-04-28,236,CUST236,Female,54,Clothing,1,25,25
2023-02-06,232,CUST232,Female,43,Beauty,1,25,25
2023-01-08,907,CUST907,Female,45,Electronics,1,25,25

In [21]:
# Calculate the sum of 'Quantity' and 'Total Amount' for each category
retail_sales.groupby('Product Category')[['Quantity', 'Total Amount']].sum()

                  Quantity  Total Amount
Product Category
Beauty                 771        143515
Clothing               894        155580
Electronics            849        156905

In [22]:
# Calculate the sum of 'Quantity' and 'Total Amount' within each gender
retail_sales.groupby('Gender')[['Quantity', 'Total Amount']].sum()

        Quantity  Total Amount
Gender
Female      1298        232840
Male        1216        223160